# GetAnalyticalProjectionType Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSketchComponent..::..GetAnalyticalProjectionType Method
AnalyticalModelSketchComponent Class See Also
---
Retrieves Analytical Projection Type preset for Sketch Component.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalyticalProjectionType GetAnalyticalProjectionType()
```

Visual Basic
---
```text
Public Function GetAnalyticalProjectionType As AnalyticalProjectionType
```

Visual C++
---
```text
public:
AnalyticalProjectionType GetAnalyticalProjectionType()
```

# ### Return Value
Indicates whether Analytical Projection is at a preset, or refers to a Datum.
# See Also
AnalyticalModelSketchComponent Class
Autodesk.Revit.DB.Structure Namespace